[Killed] BlockStatement
utils/helper/totp.helper.js:9:63
  * Generates a deterministic TOTP secret from mobileNumber + params.
  * Same inputs always produce the same secret — no DB needed.
  */
-const generateDeterministicSecret = (mobileNumber, params) => {
-    const hmac = crypto.createHmac('sha256', TOTP_MASTER_KEY);
-    hmac.update(`${mobileNumber}:${params}`);
-    return hmac.digest('hex');
-};
+const generateDeterministicSecret = (mobileNumber, params) => {};
 
 /**
killedBy: TOTP Helper Utilities generateDeterministicSecret should generate different secrets for different mobile numbers
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not undefined

[Killed] BlockStatement
utils/helper/totp.helper.js:19:33
  * Generates the current 6-digit TOTP code for the given secret.
  * step = 30s (standard TOTP window).
  */
-const generateOtp = (secret) => {
-    return speakeasy.totp({
-        secret: secret,
-        encoding: 'hex',
-        step: 30,
-        digits: 6,
-    });
-};
+const generateOtp = (secret) => {};
 
 /**
killedBy: TOTP Helper Utilities generateOtp should generate a 6-digit OTP code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: "undefined"

[Killed] BlockStatement
utils/helper/totp.helper.js:35:55
  * @param {number} validitySeconds - how long the OTP should be valid (in seconds)
  * @returns {boolean} true if token is valid within the window
  */
-const verifyOtp = (secret, token, validitySeconds) => {
-    // Window = number of 30s steps to check before/after current step.
-    // This ensures any code generated within the validity period is accepted.
-    const windowSize = Math.ceil(validitySeconds / 30) + 1;
-
-    return speakeasy.totp.verify({
-        secret: secret,
-        encoding: 'hex',
-        token: String(token),
-        step: 30,
-        window: windowSize,
-    });
-};
+const verifyOtp = (secret, token, validitySeconds) => {};
 
 module.exports = { generateDeterministicSecret, generateOtp, verifyOtp };
killedBy: TOTP Helper Utilities verifyOtp should return true for a valid OTP within the validity window
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Survived] ArithmeticOperator
utils/helper/totp.helper.js:38:24
 const verifyOtp = (secret, token, validitySeconds) => {
     // Window = number of 30s steps to check before/after current step.
     // This ensures any code generated within the validity period is accepted.
-    const windowSize = Math.ceil(validitySeconds / 30) + 1;
+    const windowSize = Math.ceil(validitySeconds / 30) - 1;
 
     return speakeasy.totp.verify({

[Survived] ArithmeticOperator
utils/helper/totp.helper.js:38:34
 const verifyOtp = (secret, token, validitySeconds) => {
     // Window = number of 30s steps to check before/after current step.
     // This ensures any code generated within the validity period is accepted.
-    const windowSize = Math.ceil(validitySeconds / 30) + 1;
+    const windowSize = Math.ceil(validitySeconds * 30) + 1;
 
     return speakeasy.totp.verify({

[Killed] ObjectLiteral
utils/helper/totp.helper.js:40:34
     // This ensures any code generated within the validity period is accepted.
     const windowSize = Math.ceil(validitySeconds / 30) + 1;
 
-    return speakeasy.totp.verify({
-        secret: secret,
-        encoding: 'hex',
-        token: String(token),
-        step: 30,
-        window: windowSize,
-    });
+    return speakeasy.totp.verify({});
 };
 
killedBy: TOTP Helper Utilities verifyOtp should return true for a valid OTP within the validity window
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
